todo.org

* DONE 实验十
  CLOSED: [2017-03-21 Tue 17:14]
** 1. 求二重积分
*** (1)
**** CODE
#+BEGIN_SRC octave
clear
syms x y;
f = x / (1+x*y);
int(int(f, y, 0, 1), x, 0，1)
#+END_SRC
**** ANS
     log(4)-1
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms a b;
[a, b] = solve(b==a*a+1,b==2*a, a, b);
syms x y;
f = x / (1+y);
int(int(f, y, x*x+1, 2*x), x, 0, a)
#+END_SRC
**** ANS
     log((2*3^(7/8))/9) + 1/2
*** (3)
**** CODE
#+BEGIN_SRC octave
clear
syms x y;
f = 1 - x - y;
int(int(f,y, 1-x, 0), x, 0, 1)
#+END_SRC
**** ANS
     -1/6
** 2. 化下列二次积分为极坐标的二次积分，并计算积分值.
*** (1)
