todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-28 Tue 08:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Li Jiajie" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5232cdc">1. <span class="done DONE">DONE</span> 实验十</a>
<ul>
<li><a href="#org6d419e2">1.1. 1. 求二重积分</a>
<ul>
<li><a href="#orgcae7897">1.1.1. (1)</a></li>
<li><a href="#org028a8da">1.1.2. (2)</a></li>
<li><a href="#org7229e82">1.1.3. (3)</a></li>
</ul>
</li>
<li><a href="#org8282d8f">1.2. 2. 化下列二次积分为极坐标的二次积分，并计算积分值.</a>
<ul>
<li><a href="#orga6d7ed3">1.2.1. (1)</a></li>
<li><a href="#org3acbb1d">1.2.2. (2)</a></li>
<li><a href="#org419fc06">1.2.3. (3)</a></li>
<li><a href="#orgc1761be">1.2.4. (4)</a></li>
</ul>
</li>
<li><a href="#org9cf3a22">1.3. 3. 求下列图形的面积</a>
<ul>
<li><a href="#orgec15fac">1.3.1. (1)</a></li>
<li><a href="#org82ca088">1.3.2. (2)</a></li>
<li><a href="#org1ed5a1c">1.3.3. (3)</a></li>
<li><a href="#org32648ea">1.3.4. (4)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcfd48e2">2. <span class="done DONE">DONE</span> 实验十一</a>
<ul>
<li><a href="#org680fed1">2.1. 1.</a></li>
<li><a href="#org7a66a35">2.2. 2.</a></li>
<li><a href="#orgf9711e7">2.3. 3.</a>
<ul>
<li><a href="#org4492926">2.3.1. CODE</a></li>
</ul>
</li>
<li><a href="#orgcc04967">2.4. 4.</a></li>
<li><a href="#org4190260">2.5. 5.</a>
<ul>
<li><a href="#org899d250">2.5.1. (1)</a></li>
<li><a href="#org84ebb43">2.5.2. (2)</a></li>
</ul>
</li>
<li><a href="#org6e24e8e">2.6. 6.</a>
<ul>
<li><a href="#orga5ee162">2.6.1. (1)</a></li>
<li><a href="#orge13d502">2.6.2. (2)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7dfab28">3. <span class="done DONE">DONE</span> 实验十二</a>
<ul>
<li><a href="#org609b0c8">3.1. 1.</a></li>
<li><a href="#org0a25e34">3.2. 2.</a></li>
<li><a href="#org6218701">3.3. 3.</a></li>
<li><a href="#orga156ae0">3.4. 4.</a></li>
<li><a href="#org0e008e4">3.5. 5.</a></li>
<li><a href="#orgb775f00">3.6. 7.</a></li>
<li><a href="#org98095b5">3.7. 8.</a></li>
</ul>
</li>
<li><a href="#org11ef039">4. <span class="done DONE">DONE</span> 实验十三</a>
<ul>
<li><a href="#org8136921">4.1. 1.</a></li>
<li><a href="#orga280402">4.2. 2.</a></li>
<li><a href="#org411054d">4.3. 3.</a></li>
<li><a href="#org16b2dd9">4.4. 4.</a></li>
<li><a href="#orga9a9f91">4.5. 5.</a></li>
<li><a href="#orgc5833c1">4.6. 6.</a></li>
<li><a href="#org4afcdfb">4.7. 7.</a></li>
<li><a href="#org92dc1ad">4.8. 8.</a>
<ul>
<li><a href="#org07ea9cd">4.8.1. (1)</a></li>
<li><a href="#orgf1e6cea">4.8.2. (2)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb4e1bf4">5. <span class="done DONE">DONE</span> 实验十四</a>
<ul>
<li><a href="#orgadf7c92">5.1. 1.</a>
<ul>
<li><a href="#org0e011f7">5.1.1. (1)</a></li>
<li><a href="#org088ab3d">5.1.2. (2)</a></li>
<li><a href="#org5f9619c">5.1.3. (3)</a></li>
</ul>
</li>
<li><a href="#orgd4d3a42">5.2. 2.</a>
<ul>
<li><a href="#org08b9495">5.2.1. (1)</a></li>
<li><a href="#org92f7531">5.2.2. (2)</a></li>
</ul>
</li>
<li><a href="#org355487d">5.3. 3.</a>
<ul>
<li><a href="#orgb554a68">5.3.1. (1)</a></li>
<li><a href="#org7b463c8">5.3.2. (2)</a></li>
<li><a href="#orgd822abc">5.3.3. (3)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgedfc4a9">6. <span class="todo TODO">TODO</span> 实验十五</a>
<ul>
<li><a href="#org0e177d9">6.1. 1.</a></li>
<li><a href="#orgeca91c0">6.2. 2.</a></li>
<li><a href="#org45e5a5f">6.3. <span class="todo TODO">TODO</span> 3.</a></li>
<li><a href="#orgc9b9d3a">6.4. 4.</a></li>
<li><a href="#org6fa1e1a">6.5. <span class="todo TODO">TODO</span> 5.</a>
<ul>
<li><a href="#org82b41a7">6.5.1. (1)</a></li>
<li><a href="#org2811729">6.5.2. (2)</a></li>
</ul>
</li>
<li><a href="#org99bbfe4">6.6. 6.</a></li>
</ul>
</li>
<li><a href="#org78aa456">7. <span class="done DONE">DONE</span> 实验十九</a>
<ul>
<li><a href="#org536af3f">7.1. 1.</a>
<ul>
<li><a href="#org7a4f54c">7.1.1. 例1</a></li>
<li><a href="#org8c548a6">7.1.2. 例2</a></li>
<li><a href="#orgf1556e1">7.1.3. 例3</a></li>
</ul>
</li>
<li><a href="#org7c2f489">7.2. 2.</a></li>
</ul>
</li>
<li><a href="#orgd6d8ab6">8. <span class="done DONE">DONE</span> 实验二十三</a>
<ul>
<li>
<ul>
<li><a href="#orgfe4aff0">8.0.1. 计算各个统计量</a></li>
<li><a href="#orgc07ef24">8.0.2. 处理缺失数据</a></li>
</ul>
</li>
<li><a href="#orgde58879">8.1. 1.</a></li>
<li><a href="#org96a8473">8.2. 2.</a></li>
<li><a href="#org260967d">8.3. 3.</a></li>
</ul>
</li>
<li><a href="#org584140c">9. <span class="done DONE">DONE</span> 实验三十</a>
<ul>
<li><a href="#orgd8cdee8">9.1. 1.</a></li>
<li><a href="#org9311eed">9.2. 2.</a></li>
<li><a href="#orgcbe937c">9.3. 3.</a></li>
</ul>
</li>
<li><a href="#orgf50f21d">10. <span class="done DONE">DONE</span> 实验三十一</a>
<ul>
<li><a href="#org33f85ac">10.1. 1.</a></li>
<li><a href="#org505cc8e">10.2. 2.</a></li>
</ul>
</li>
<li><a href="#org465a841">11. <span class="done DONE">DONE</span> 实验三十四</a>
<ul>
<li><a href="#orgce7ca27">11.1. 1.</a></li>
<li><a href="#orgb16d8c8">11.2. 2.</a></li>
<li><a href="#org9b5dc91">11.3. 3.</a></li>
<li><a href="#orga543b0c">11.4. 4.</a></li>
</ul>
</li>
<li><a href="#org0efb85f">12. <span class="done DONE">DONE</span> 实验三十五</a>
<ul>
<li><a href="#orgc4c420a">12.1. 1.</a></li>
<li><a href="#orge807134">12.2. 2.</a></li>
<li><a href="#org037047f">12.3. 3.</a></li>
</ul>
</li>
<li><a href="#org06d4eae">13. <span class="done DONE">DONE</span> 实验三十六</a>
<ul>
<li><a href="#org2e36c1e">13.1. 1.</a></li>
<li><a href="#org88318a7">13.2. 2.</a></li>
<li><a href="#org57fc4f6">13.3. 3.</a></li>
</ul>
</li>
<li><a href="#orgf58d5a3">14. <span class="done DONE">DONE</span> 实验三十七</a>
<ul>
<li><a href="#orge6212a0">14.1. 1.</a></li>
<li><a href="#orgac24357">14.2. 2.</a></li>
</ul>
</li>
<li><a href="#orgb0092dc">15. <span class="todo TODO">TODO</span> 实验三十八</a></li>
<li><a href="#org4368d3b">16. <span class="todo TODO">TODO</span> 实验四十三</a>
<ul>
<li><a href="#org668a6b5">16.1. 1.</a></li>
<li><a href="#org25b67fd">16.2. 2.</a></li>
<li><a href="#org00c172d">16.3. 3.</a></li>
<li><a href="#orgc3f316b">16.4. 4.</a></li>
<li><a href="#org29922a5">16.5. 5.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5232cdc" class="outline-2">
<h2 id="org5232cdc"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> 实验十</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6d419e2" class="outline-3">
<h3 id="org6d419e2"><span class="section-number-3">1.1</span> 1. 求二重积分</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgcae7897" class="outline-4">
<h4 id="orgcae7897"><span class="section-number-4">1.1.1</span> (1)</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><ol class="org-ol"><li><a id="org6468263"></a>CODE<br /><div class="outline-text-5" id="text-1-1-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #dd724d;">x</span> <span style="color: #F92672;">/</span> <span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">+</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">*</span><span style="color: #00a7c3;">y</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0&#65292;1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgb5d6b7b"></a>ANS<br /><div class="outline-text-5" id="text-1-1-1-2">
<p>
log(4)-1
</p>
</div></li></ol>
</div>
<div id="outline-container-org028a8da" class="outline-4">
<h4 id="org028a8da"><span class="section-number-4">1.1.2</span> (2)</h4>
<div class="outline-text-4" id="text-1-1-2">
</div><ol class="org-ol"><li><a id="org7fa60d0"></a>CODE<br /><div class="outline-text-5" id="text-1-1-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #40a357;">a</span> <span style="color: #00a7b3;">b</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #40a357;">a</span><span style="color: #F92672;">,</span> <span style="color: #00a7b3;">b</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #0096f1;">solve</span><span style="color: #AE81FF;">(</span><span style="color: #00a7b3;">b</span><span style="color: #F92672;">==</span><span style="color: #40a357;">a</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span><span style="color: #00a7b3;">b</span><span style="color: #F92672;">==</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">,</span> <span style="color: #40a357;">a</span><span style="color: #F92672;">,</span> <span style="color: #00a7b3;">b</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #dd724d;">x</span> <span style="color: #F92672;">/</span> <span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">+</span><span style="color: #00a7c3;">y</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #40a357;">a</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org1588999"></a>ANS<br /><div class="outline-text-5" id="text-1-1-2-2">
<p>
log((2*3<sup>(7/8)</sup>)/9) + 1/2
</p>
</div></li></ol>
</div>
<div id="outline-container-org7229e82" class="outline-4">
<h4 id="org7229e82"><span class="section-number-4">1.1.3</span> (3)</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><ol class="org-ol"><li><a id="orgd89c04b"></a>CODE<br /><div class="outline-text-5" id="text-1-1-3-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">-</span> <span style="color: #dd724d;">x</span> <span style="color: #F92672;">-</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgf568612"></a>ANS<br /><div class="outline-text-5" id="text-1-1-3-2">
<p>
-1/6
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org8282d8f" class="outline-3">
<h3 id="org8282d8f"><span class="section-number-3">1.2</span> 2. 化下列二次积分为极坐标的二次积分，并计算积分值.</h3>
