todo.org
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(r*r*r, r, 0, sqrt(2)), f, 0, pi/4)
#+END_SRC
**** ANS
     pi/4
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(1, r, 0, sin(f)/(cos(f)*cos(f))), f, 0, pi/4)
#+END_SRC
**** ANS
     sqrt(2) - 1
*** (3)
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(1/(r*r), r, 1/(sin(f)+cos(f)), 1), f, 0, pi/2)
#+END_SRC
**** ANS
     2-pi/2
*** (4)
#+BEGIN_SRC octave
clear
syms r f;
int(int(tan(f)*r*r, r, 1/cos(f), 2/cos(f)), f, 0, pi/4)
#+END_SRC
**** ANS
     (14*2^(1/2))/9 - 7/9
** 3. 求下列图形的面积
*** (1)
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(r, r, 0, cos(3*f)), f, -pi/3, pi/3)
#+END_SRC
**** ANS
     pi/6
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(r, r, 0, 1-sin(f)), f, 0, 2*pi)
#+END_SRC
**** ANS
     (3*pi)/2
*** (3)
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(r, r, 1-sin(f), cos(3*f)), f, -pi/3, pi/3)
#+END_SRC
**** ANS
     3^(1/2)/8 - pi/3
*** (4)
