todo.html
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orga6d7ed3" class="outline-4">
<h4 id="orga6d7ed3"><span class="section-number-4">1.2.1</span> (1)</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="orgca54ca7"></a>CODE<br /><div class="outline-text-5" id="text-1-2-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org57a7aae"></a>ANS<br /><div class="outline-text-5" id="text-1-2-1-2">
<p>
pi/4
</p>
</div></li></ol>
</div>
<div id="outline-container-org3acbb1d" class="outline-4">
<h4 id="org3acbb1d"><span class="section-number-4">1.2.2</span> (2)</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="org8763bad"></a>CODE<br /><div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #0098f0;">sin</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">/</span><span style="color: #A6E22E;">(</span><span style="color: #dc734b;">cos</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org8556e2d"></a>ANS<br /><div class="outline-text-5" id="text-1-2-2-2">
<p>
sqrt(2) - 1
</p>
</div></li></ol>
</div>
<div id="outline-container-org419fc06" class="outline-4">
<h4 id="org419fc06"><span class="section-number-4">1.2.3</span> (3)</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="org0f8432c"></a>CODE<br /><div class="outline-text-5" id="text-1-2-3-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #A6E22E;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #A6E22E;">(</span><span style="color: #0098f0;">sin</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #F92672;">+</span><span style="color: #dc734b;">cos</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org508e1bf"></a>ANS<br /><div class="outline-text-5" id="text-1-2-3-2">
<p>
2-pi/2
</p>
</div></li></ol>
</div>
<div id="outline-container-orgc1761be" class="outline-4">
<h4 id="orgc1761be"><span class="section-number-4">1.2.4</span> (4)</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #009fe8;">tan</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #dc734b;">cos</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">/</span><span style="color: #dc734b;">cos</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="org8f5afe4"></a>ANS<br /><div class="outline-text-5" id="text-1-2-4-1">
<p>
(14*2<sup>(1/2)</sup>)/9 - 7/9
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org9cf3a22" class="outline-3">
<h3 id="org9cf3a22"><span class="section-number-3">1.3</span> 3. 求下列图形的面积</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orgec15fac" class="outline-4">
<h4 id="orgec15fac"><span class="section-number-4">1.3.1</span> (1)</h4>
<div class="outline-text-4" id="text-1-3-1">
</div><ol class="org-ol"><li><a id="org44ab37f"></a>CODE<br /><div class="outline-text-5" id="text-1-3-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #dc734b;">cos</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #F92672;">-</span><span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgc9d62d5"></a>ANS<br /><div class="outline-text-5" id="text-1-3-1-2">
<p>
pi/6
</p>
</div></li></ol>
</div>
<div id="outline-container-org82ca088" class="outline-4">
<h4 id="org82ca088"><span class="section-number-4">1.3.2</span> (2)</h4>
<div class="outline-text-4" id="text-1-3-2">
</div><ol class="org-ol"><li><a id="org607815f"></a>CODE<br /><div class="outline-text-5" id="text-1-3-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #0098f0;">sin</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgbee9563"></a>ANS<br /><div class="outline-text-5" id="text-1-3-2-2">
<p>
(3*pi)/2
</p>
</div></li></ol>
</div>
<div id="outline-container-org1ed5a1c" class="outline-4">
<h4 id="org1ed5a1c"><span class="section-number-4">1.3.3</span> (3)</h4>
<div class="outline-text-4" id="text-1-3-3">
</div><ol class="org-ol"><li><a id="orgb1cbefd"></a>CODE<br /><div class="outline-text-5" id="text-1-3-3-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #0098f0;">sin</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #dc734b;">cos</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #F92672;">-</span><span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
