todo.org
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(r, r, 1, 3), f, 0, 1/3) ...
 + int(int(r, r, 1, 1/f), f, 1/3, 1) ...
 + int(int(r, r, 1/f, pi/2), f, 1, pi/2)
#+END_SRC
**** ANS
     (pi^2*(pi/2 - 1))/8 + 1/pi + 3/2
* DONE 实验十一
  CLOSED: [2017-03-21 Tue 18:17]
** 1.
**** CODE
#+BEGIN_SRC octave
clear
syms x y z;
f = x*y*y*z*z*z;
int(int(int(f, y, x, z/x), x, sqrt(z), 1), z, 0, 1)
#+END_SRC
**** ANS
     -1/364
** 2.
**** CODE
#+BEGIN_SRC octave
clear
syms r f z;
int(int(int(r*z, r, 0, sqrt(z)), f, 0, 2*pi), z, 1, 2)
#+END_SRC
**** ANS
     (7*pi)/3
** 3.
*** CODE
#+BEGIN_SRC octave
clear
syms x y z;
f = (1/(1+x+y+z))^3
int(int(int(f, y, 0, 1-z-x), x, 0, 1-z), z, 0, 1)
#+END_SRC
**** ANS
     log(2)/2 - 5/16
** 4.
**** CODE
#+BEGIN_SRC octave
clear
syms x y z;
f = x*z;
int(int(int(f, z, 0, y), y, x*x, 1), x, -1, 1)
#+END_SRC
**** ANS
     0
** 5.
*** (1)
