todo.html
<li><a id="org04f06e7"></a>ANS<br /><div class="outline-text-5" id="text-1-3-3-2">
<p>
3<sup>(1/2)</sup>/8 - pi/3
</p>
</div></li></ol>
</div>
<div id="outline-container-org32648ea" class="outline-4">
<h4 id="org32648ea"><span class="section-number-4">1.3.4</span> (4)</h4>
<div class="outline-text-4" id="text-1-3-4">
</div><ol class="org-ol"><li><a id="org7cca820"></a>CODE<br /><div class="outline-text-5" id="text-1-3-4-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">...</span>
 <span style="color: #F92672;">+</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #d66ab4;">f</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">...</span>
 <span style="color: #F92672;">+</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgc4bb54f"></a>ANS<br /><div class="outline-text-5" id="text-1-3-4-2">
<p>
(pi<sup>2</sup>*(pi/2 - 1))/8 + 1/pi + 3/2
</p>
</div></li></ol>
</div>
</div>
</div>
<div id="outline-container-orgcfd48e2" class="outline-2">
<h2 id="orgcfd48e2"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> 实验十一</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org680fed1" class="outline-3">
<h3 id="org680fed1"><span class="section-number-3">2.1</span> 1.</h3>
<div class="outline-text-3" id="text-2-1">
</div><ol class="org-ol"><li><a id="org25055c7"></a>CODE<br /><div class="outline-text-5" id="text-2-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">*</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">*</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">*</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">*</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">*</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">/</span><span style="color: #dd724d;">x</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #00a7ba;">z</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgff49f14"></a>ANS<br /><div class="outline-text-5" id="text-2-1-0-2">
<p>
-1/364
</p>
</div></li></ol>
</div>
<div id="outline-container-org7a66a35" class="outline-3">
<h3 id="org7a66a35"><span class="section-number-3">2.2</span> 2.</h3>
<div class="outline-text-3" id="text-2-2">
</div><ol class="org-ol"><li><a id="org6e769f7"></a>CODE<br /><div class="outline-text-5" id="text-2-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #a78f27;">sqrt</span><span style="color: #E6DB74;">(</span><span style="color: #00a7ba;">z</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org7d17d32"></a>ANS<br /><div class="outline-text-5" id="text-2-2-0-2">
<p>
(7*pi)/3
</p>
</div></li></ol>
</div>
<div id="outline-container-orgf9711e7" class="outline-3">
<h3 id="orgf9711e7"><span class="section-number-3">2.3</span> 3.</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-org4492926" class="outline-4">
<h4 id="org4492926"><span class="section-number-4">2.3.1</span> CODE</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">+</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">+</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">+</span><span style="color: #00a7ba;">z</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">3</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">-</span><span style="color: #dd724d;">x</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #00a7ba;">z</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="org612c086"></a>ANS<br /><div class="outline-text-5" id="text-2-3-1-1">
<p>
log(2)/2 - 5/16
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-orgcc04967" class="outline-3">
<h3 id="orgcc04967"><span class="section-number-3">2.4</span> 4.</h3>
<div class="outline-text-3" id="text-2-4">
</div><ol class="org-ol"><li><a id="orgc7cf65d"></a>CODE<br /><div class="outline-text-5" id="text-2-4-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">*</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
