todo.org
**** CODE
#+BEGIN_SRC octave
clear
syms r f z;
int(int(int(z, z, r*r, sqrt(2-r*r))*r, r, 0, 1), z, 0, 2*pi)
#+END_SRC
**** ANS
     (7*pi)/12
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms r f z;
int(int(int(r*r, z, 2, r*r/2)*r, r, 2, 0), f, 0, 2*pi)
#+END_SRC
**** ANS
     (16*pi)/3
** 6.
*** (1)
**** CODE
#+BEGIN_SRC octave
clear
syms r f t;
int(int(int(r*r*sin(f), r, 0, 1), f, 0, pi), t, 0, 2*pi)
#+END_SRC
**** ANS
     (4*pi)/3
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms r f t a;
int(int(int(r*cos(f)*r*r*sin(f), r, 0, 2*a*cos(f)), f, pi/4, pi/2), t, 0, 2*pi)
#+END_SRC
**** ANS
     (pi*a^4)/6
* DONE 实验十二
  CLOSED: [2017-03-21 Tue 20:01]
** 1.
**** CODE
#+BEGIN_SRC octave
clear
syms t;
f = t*(2/3)*sqrt(2*t*t*t)*(1/2)*t*t;
int(f*(t+1), t, 0, 1)
#+END_SRC
**** ANS
     (16*2^(1/2))/143
** 2.
**** CODE
#+BEGIN_SRC octave
clear
syms t a;
int(sqrt(2)*(a^3)*((1-cos(t))^(3/2)), t, 0, 2*pi)
#+END_SRC
**** ANS
     int(2^(1/2)*a^3*(1 - cos(t))^(3/2), t, 0, 2*pi)
** 3.
