todo.html
<li><a id="org7dba244"></a>ANS<br /><div class="outline-text-5" id="text-2-4-0-2">
<p>
0
</p>
</div></li></ol>
</div>
<div id="outline-container-org4190260" class="outline-3">
<h3 id="org4190260"><span class="section-number-3">2.5</span> 5.</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-org899d250" class="outline-4">
<h4 id="org899d250"><span class="section-number-4">2.5.1</span> (1)</h4>
<div class="outline-text-4" id="text-2-5-1">
</div><ol class="org-ol"><li><a id="org84f614c"></a>CODE<br /><div class="outline-text-5" id="text-2-5-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #a78f27;">sqrt</span><span style="color: #E6DB74;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orga4534d0"></a>ANS<br /><div class="outline-text-5" id="text-2-5-1-2">
<p>
(7*pi)/12
</p>
</div></li></ol>
</div>
<div id="outline-container-org84ebb43" class="outline-4">
<h4 id="org84ebb43"><span class="section-number-4">2.5.2</span> (2)</h4>
<div class="outline-text-4" id="text-2-5-2">
</div><ol class="org-ol"><li><a id="org7579274"></a>CODE<br /><div class="outline-text-5" id="text-2-5-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org9b3a8dd"></a>ANS<br /><div class="outline-text-5" id="text-2-5-2-2">
<p>
(16*pi)/3
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org6e24e8e" class="outline-3">
<h3 id="org6e24e8e"><span class="section-number-3">2.6</span> 6.</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-orga5ee162" class="outline-4">
<h4 id="orga5ee162"><span class="section-number-4">2.6.1</span> (1)</h4>
<div class="outline-text-4" id="text-2-6-1">
</div><ol class="org-ol"><li><a id="org8f0f899"></a>CODE<br /><div class="outline-text-5" id="text-2-6-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgb0165f8"></a>ANS<br /><div class="outline-text-5" id="text-2-6-1-2">
<p>
(4*pi)/3
</p>
</div></li></ol>
</div>
<div id="outline-container-orge13d502" class="outline-4">
<h4 id="orge13d502"><span class="section-number-4">2.6.2</span> (2)</h4>
<div class="outline-text-4" id="text-2-6-2">
</div><ol class="org-ol"><li><a id="orgf60bb3d"></a>CODE<br /><div class="outline-text-5" id="text-2-6-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #7e9a33;">t</span> <span style="color: #40a357;">a</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #E6DB74;">(</span><span style="color: #d66ab4;">f</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org00f8fe8"></a>ANS<br /><div class="outline-text-5" id="text-2-6-2-2">
<p>
(pi*a<sup>4</sup>)/6
</p>
</div></li></ol>
</div>
</div>
</div>
<div id="outline-container-org7dfab28" class="outline-2">
<h2 id="org7dfab28"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> 实验十二</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org609b0c8" class="outline-3">
<h3 id="org609b0c8"><span class="section-number-3">3.1</span> 1.</h3>
<div class="outline-text-3" id="text-3-1">
</div><ol class="org-ol"><li><a id="orge8e16d7"></a>CODE<br /><div class="outline-text-5" id="text-3-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">*</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">*</span><span style="color: #a78f27;">sqrt</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #7e9a33;">t</span><span style="color: #F92672;">*</span><span style="color: #7e9a33;">t</span><span style="color: #F92672;">*</span><span style="color: #7e9a33;">t</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">*</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">*</span><span style="color: #7e9a33;">t</span><span style="color: #F92672;">*</span><span style="color: #7e9a33;">t</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">*</span><span style="color: #66D9EF;">(</span><span style="color: #7e9a33;">t</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgc830c72"></a>ANS<br /><div class="outline-text-5" id="text-3-1-0-2">
<p>
(16*2<sup>(1/2)</sup>)/143
</p>
</div></li></ol>
</div>
<div id="outline-container-org0a25e34" class="outline-3">
<h3 id="org0a25e34"><span class="section-number-3">3.2</span> 2.</h3>
<div class="outline-text-3" id="text-3-2">
</div><ol class="org-ol"><li><a id="org1275856"></a>CODE<br /><div class="outline-text-5" id="text-3-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #7e9a33;">t</span> <span style="color: #40a357;">a</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #a78f27;">sqrt</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">*</span><span style="color: #66D9EF;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">*</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #dc734b;">cos</span><span style="color: #E6DB74;">(</span><span style="color: #7e9a33;">t</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">^</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org66facf4"></a>ANS<br /><div class="outline-text-5" id="text-3-2-0-2">
<p>
int(2<sup>(1/2)</sup>*a<sup>3</sup>*(1 - cos(t))<sup>(3/2)</sup>, t, 0, 2*pi)
</p>
</div></li></ol>
</div>
