todo.org
**** CODE
#+BEGIN_SRC octave
clear
syms t a b;
f = a^2 * cos(t) * sin(t) * b * t;
int(f*sqrt(a^2+b^2), t, 0, 2*pi)
#+END_SRC
**** ANS
     -(pi*a^2*b*(a^2 + b^2)^(1/2))/2
** 4.
**** CODE
#+BEGIN_SRC octave
clear
syms t a;
int(a*a, t, -pi/2, pi/2)
#+END_SRC
**** ANS
     pi*a^2
** 5.
#+BEGIN_SRC octave
clear
syms t a;
4*int((a^(4/3)-2*a^(4/3)*cos(t)^2*sin(t)^2)*3*a*sin(t)*cos(t), t, 0, pi/2)
#+END_SRC
**** ANS
     4*a^(7/3)
** 7.
#+BEGIN_SRC octave
clear
syms x a;
I1 = int(x^2, x, 0, 2);
I2 = int(sqrt(2)*(2*x^2-4*x+4), x, 2, 1);
I3 = int(sqrt(2)*(2*x^2), x, 1, 0);
I = I1 + I2 + I3
#+END_SRC
**** ANS
     8/3 - (10*2^(1/2))/3
** 8.
**** CODE
#+BEGIN_SRC octave
% 口算
-1/6*a^2*2*pi*a
#+END_SRC
**** DONE ANS
     CLOSED: [2017-03-21 Tue 20:01]
     -1/3*pi*a^3
* DONE 实验十三
  CLOSED: [2017-03-22 Wed 08:26]
** 1.
**** CODE
#+BEGIN_SRC octave
clear
syms t a
I1 = int((a+a*sin(t))*a*(1-cos(t)), t, 0, 2*pi);
I2 = int(a*sin(t), t, 0, 2*pi);
I = I1 + I2
#+END_SRC
**** ANS
     2*pi*a^2
** 2.
**** CODE
#+BEGIN_SRC octave
clear
syms t a
int(sin(2*t), t, 0, 2*pi)
#+END_SRC
**** ANS
     0
** 3.
**** CODE
#+BEGIN_SRC octave
clear
syms t a
I1 = int(t+1, t, 0, 1);
I2 = int(t+2, t, 0, 1);
I3 = int(t+3, t, 0, 1);
I = I1 + I2 + I3
#+END_SRC
**** ANS
     15/2
** 4.
