todo.html
<div id="outline-container-org6218701" class="outline-3">
<h3 id="org6218701"><span class="section-number-3">3.3</span> 3.</h3>
<div class="outline-text-3" id="text-3-3">
</div><ol class="org-ol"><li><a id="orgb40ec36"></a>CODE<br /><div class="outline-text-5" id="text-3-3-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #7e9a33;">t</span> <span style="color: #40a357;">a</span> <span style="color: #00a7b3;">b</span><span style="color: #F92672;">;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span> <span style="color: #F92672;">*</span> <span style="color: #dc734b;">cos</span><span style="color: #AE81FF;">(</span><span style="color: #7e9a33;">t</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">*</span> <span style="color: #0098f0;">sin</span><span style="color: #AE81FF;">(</span><span style="color: #7e9a33;">t</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">*</span> <span style="color: #00a7b3;">b</span> <span style="color: #F92672;">*</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">*</span><span style="color: #a78f27;">sqrt</span><span style="color: #66D9EF;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">+</span><span style="color: #00a7b3;">b</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgc1a661a"></a>ANS<br /><div class="outline-text-5" id="text-3-3-0-2">
<p>
-(pi*a<sup>2</sup>*b*(a<sup>2</sup> + b<sup>2</sup>)<sup>(1/2)</sup>)/2
</p>
</div></li></ol>
</div>
<div id="outline-container-orga156ae0" class="outline-3">
<h3 id="orga156ae0"><span class="section-number-3">3.4</span> 4.</h3>
<div class="outline-text-3" id="text-3-4">
</div><ol class="org-ol"><li><a id="orgec68ccc"></a>CODE<br /><div class="outline-text-5" id="text-3-4-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #7e9a33;">t</span> <span style="color: #40a357;">a</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #F92672;">-</span><span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgc7f35a0"></a>ANS<br /><div class="outline-text-5" id="text-3-4-0-2">
<p>
pi*a<sup>2</sup>
</p>
</div></li></ol>
</div>
<div id="outline-container-org0e008e4" class="outline-3">
<h3 id="org0e008e4"><span class="section-number-3">3.5</span> 5.</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #7e9a33;">t</span> <span style="color: #40a357;">a</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">4</span><span style="color: #F92672;">*</span><span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #A6E22E;">(</span><span style="color: #7e9a33;">t</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #A6E22E;">(</span><span style="color: #7e9a33;">t</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">*</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #66D9EF;">(</span><span style="color: #7e9a33;">t</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #66D9EF;">(</span><span style="color: #7e9a33;">t</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgff08b54"></a>ANS<br /><div class="outline-text-5" id="text-3-5-0-1">
<p>
4*a<sup>(7/3)</sup>
</p>
</div></li></ol>
</div>
<div id="outline-container-orgb775f00" class="outline-3">
<h3 id="orgb775f00"><span class="section-number-3">3.6</span> 7.</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #40a357;">a</span><span style="color: #F92672;">;</span>
<span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #ae7ad7;">I2</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #a78f27;">sqrt</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">*</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">4</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #7c9b34;">I3</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #a78f27;">sqrt</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">*</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #42a356;">I</span> <span style="color: #F92672;">=</span> <span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">+</span> <span style="color: #ae7ad7;">I2</span> <span style="color: #F92672;">+</span> <span style="color: #7c9b34;">I3</span>
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="org5fa12a1"></a>ANS<br /><div class="outline-text-5" id="text-3-6-0-1">
<p>
8/3 - (10*2<sup>(1/2)</sup>)/3
</p>
</div></li></ol>
</div>
<div id="outline-container-org98095b5" class="outline-3">
<h3 id="org98095b5"><span class="section-number-3">3.7</span> 8.</h3>
<div class="outline-text-3" id="text-3-7">
</div><ol class="org-ol"><li><a id="org3947a6c"></a>CODE<br /><div class="outline-text-5" id="text-3-7-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #75715E;">% </span><span style="color: #75715E;">&#21475;&#31639;</span>
<span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">6</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span>
</pre>
</div>
</div></li>
<li><a id="orgd791197"></a><span class="done DONE">DONE</span> ANS<br /><div class="outline-text-5" id="text-3-7-0-2">
<p>
-1/3*pi*a<sup>3</sup>
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org11ef039" class="outline-2">
<h2 id="org11ef039"><span class="section-number-2">4</span> <span class="done DONE">DONE</span> 实验十三</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8136921" class="outline-3">
<h3 id="org8136921"><span class="section-number-3">4.1</span> 1.</h3>
<div class="outline-text-3" id="text-4-1">
</div><ol class="org-ol"><li><a id="orgdcb2bc4"></a>CODE<br /><div class="outline-text-5" id="text-4-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #7e9a33;">t</span> <span style="color: #40a357;">a</span>
<span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">+</span><span style="color: #40a357;">a</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #A6E22E;">(</span><span style="color: #7e9a33;">t</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">*</span><span style="color: #40a357;">a</span><span style="color: #F92672;">*</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #dc734b;">cos</span><span style="color: #A6E22E;">(</span><span style="color: #7e9a33;">t</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #ae7ad7;">I2</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #66D9EF;">(</span><span style="color: #7e9a33;">t</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #42a356;">I</span> <span style="color: #F92672;">=</span> <span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">+</span> <span style="color: #ae7ad7;">I2</span>
</pre>
</div>
</div></li>
