todo.org
**** CODE
#+BEGIN_SRC octave
clear
syms r f z;
int(int(int(r^3, r, 0, sqrt(2-z)), f, 0, pi/2), z, 0, 2)
#+END_SRC
**** ANS
     pi/3
*** (3)
**** CODE
#+BEGIN_SRC octave
clear
syms r f z;
int(int(int(3*z*r, r, 0, sqrt(2-z)), f, 0, pi/2), z, 0, 2)
#+END_SRC
**** ANS
     pi
** 2.
*** (1)
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
I1 = int(int(sqrt(2)*r^3, r, 0, 1), f, 0, 2*pi);
I2 = int(int(r^3, r, 0, 1), f, 0, 2*pi);
I = I1 + I2
#+END_SRC
**** ANS
     pi/2 + (pi*2^(1/2))/2
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms r f;
int(int(2*r, r, 0, 1), f, 0, 2*pi)
#+END_SRC
**** ANS
     2*pi
** 3.
*** (1)
**** CODE
#+BEGIN_SRC octave
clear
syms x y;
z = 4-2*x-4/3*y;
int(int((z+2*x+4/3*y)*sqrt(1+4+16/9), x, 0, 2), y, 0, 3)
#+END_SRC
**** ANS
     8*61^(1/2)
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms x y;
z = 6-2*x-2*y;
int(int(3*(2*x*y-2*x^2-x+z), x, 0, 3), y, 0, 3)
#+END_SRC
**** ANS
     -81
