todo.html
<li><a id="orgd21af8d"></a>ANS<br /><div class="outline-text-5" id="text-5-1-1-2">
<p>
pi/2
</p>
</div></li></ol>
</div>
<div id="outline-container-org088ab3d" class="outline-4">
<h4 id="org088ab3d"><span class="section-number-4">5.1.2</span> (2)</h4>
<div class="outline-text-4" id="text-5-1-2">
</div><ol class="org-ol"><li><a id="org004d5d1"></a>CODE<br /><div class="outline-text-5" id="text-5-1-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #a78f27;">sqrt</span><span style="color: #E6DB74;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #00a7ba;">z</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orge5a0873"></a>ANS<br /><div class="outline-text-5" id="text-5-1-2-2">
<p>
pi/3
</p>
</div></li></ol>
</div>
<div id="outline-container-org5f9619c" class="outline-4">
<h4 id="org5f9619c"><span class="section-number-4">5.1.3</span> (3)</h4>
<div class="outline-text-4" id="text-5-1-3">
</div><ol class="org-ol"><li><a id="org85944c0"></a>CODE<br /><div class="outline-text-5" id="text-5-1-3-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #a78f27;">sqrt</span><span style="color: #E6DB74;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #00a7ba;">z</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">pi</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgb064e17"></a>ANS<br /><div class="outline-text-5" id="text-5-1-3-2">
<p>
pi
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-orgd4d3a42" class="outline-3">
<h3 id="orgd4d3a42"><span class="section-number-3">5.2</span> 2.</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-org08b9495" class="outline-4">
<h4 id="org08b9495"><span class="section-number-4">5.2.1</span> (1)</h4>
<div class="outline-text-4" id="text-5-2-1">
</div><ol class="org-ol"><li><a id="orga8f099e"></a>CODE<br /><div class="outline-text-5" id="text-5-2-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #ae7ad7;">I2</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #42a356;">I</span> <span style="color: #F92672;">=</span> <span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">+</span> <span style="color: #ae7ad7;">I2</span>
</pre>
</div>
</div></li>
<li><a id="orgac7f8e7"></a>ANS<br /><div class="outline-text-5" id="text-5-2-1-2">
<p>
pi/2 + (pi*2<sup>(1/2)</sup>)/2
</p>
</div></li></ol>
</div>
<div id="outline-container-org92f7531" class="outline-4">
<h4 id="org92f7531"><span class="section-number-4">5.2.2</span> (2)</h4>
<div class="outline-text-4" id="text-5-2-2">
</div><ol class="org-ol"><li><a id="org04a1aa0"></a>CODE<br /><div class="outline-text-5" id="text-5-2-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org9b625cc"></a>ANS<br /><div class="outline-text-5" id="text-5-2-2-2">
<p>
2*pi
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org355487d" class="outline-3">
<h3 id="org355487d"><span class="section-number-3">5.3</span> 3.</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-orgb554a68" class="outline-4">
<h4 id="orgb554a68"><span class="section-number-4">5.3.1</span> (1)</h4>
<div class="outline-text-4" id="text-5-3-1">
</div><ol class="org-ol"><li><a id="orgad9679d"></a>CODE<br /><div class="outline-text-5" id="text-5-3-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #00a7ba;">z</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">4</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span><span style="color: #00a7ba;">z</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #00a7c3;">y</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">*</span><span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">16</span><span style="color: #F92672;">/</span><span style="color: #AE81FF;">9</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org2b9aa9e"></a>ANS<br /><div class="outline-text-5" id="text-5-3-1-2">
<p>
8*61<sup>(1/2)</sup>
</p>
</div></li></ol>
</div>
<div id="outline-container-org7b463c8" class="outline-4">
<h4 id="org7b463c8"><span class="section-number-4">5.3.2</span> (2)</h4>
<div class="outline-text-4" id="text-5-3-2">
</div><ol class="org-ol"><li><a id="org757edb6"></a>CODE<br /><div class="outline-text-5" id="text-5-3-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #00a7ba;">z</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">6</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">;</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">*</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">+</span><span style="color: #00a7ba;">z</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
