todo.org
*** (3)
#+BEGIN_SRC octave
clear
syms r f a h;
sqrt(a^2-h^2)*int(int(r, r, 0, sqrt(a^2-h^2)), f, 0, 2*pi)
#+END_SRC
**** ANS
     pi*(a^2 - h^2)^(3/2)
* TODO 实验十五
** 1.
**** CODE
#+BEGIN_SRC octave
clear
syms r f R
int(int(r^4*sin(f)^2*cos(f)^2*sqrt(R^2-r^2), r, 0, R), f, 0, 2*pi)
#+END_SRC
**** ANS
     (R^6*pi^2)/128
** 2.
**** CODE
#+BEGIN_SRC octave
clear
syms x y z
I1 = int(int(sqrt(1-y^2), y, 0, 1), z, 0, 3);
I2 = int(int(sqrt(1-x^2), x, 0, 1), z ,0 ,3);
I = I1 + I2
#+END_SRC
**** ANS
     (3*pi)/2
** TODO 3.
**** CODE
#+BEGIN_SRC octave
clear
syms x y z

#+END_SRC
**** ANS
** 4.
**** CODE
#+BEGIN_SRC octave
clear
syms x y
3*int(int(x*(1-x-y), x, 0, 1), y, 1, 0)
#+END_SRC
**** ANS
     1/4
** TODO 5.
*** (1)
**** CODE
#+BEGIN_SRC octave
clear
syms x y

#+END_SRC
**** ANS
*** (2)
**** CODE
#+BEGIN_SRC octave
clear
syms x y

#+END_SRC
**** ANS
** 6.
**** CODE
#+BEGIN_SRC octave
clear
syms r f e
int(int(e^2, r, 1, 2), f, 0, 2*pi)
#+END_SRC
**** ANS
     2*pi*e^2
* DONE 实验十九
  CLOSED: [2017-03-22 Wed 16:11]
** 1.
*** 例1
