todo.html
<li><a id="org84d43a4"></a>ANS<br /><div class="outline-text-5" id="text-5-3-2-2">
<p>
-81
</p>
</div></li></ol>
</div>
<div id="outline-container-orgd822abc" class="outline-4">
<h4 id="orgd822abc"><span class="section-number-4">5.3.3</span> (3)</h4>
<div class="outline-text-4" id="text-5-3-3">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #40a357;">a</span> <span style="color: #00a8a7;">h</span><span style="color: #F92672;">;</span>
<span style="color: #a78f27;">sqrt</span><span style="color: #AE81FF;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #00a8a7;">h</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">*</span><span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #40a357;">a</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #00a8a7;">h</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="org7af194b"></a>ANS<br /><div class="outline-text-5" id="text-5-3-3-1">
<p>
pi*(a<sup>2</sup> - h<sup>2</sup>)<sup>(3/2)</sup>
</p>
</div></li></ol>
</div>
</div>
</div>
<div id="outline-container-orgedfc4a9" class="outline-2">
<h2 id="orgedfc4a9"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> 实验十五</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-org0e177d9" class="outline-3">
<h3 id="org0e177d9"><span class="section-number-3">6.1</span> 1.</h3>
<div class="outline-text-3" id="text-6-1">
</div><ol class="org-ol"><li><a id="org4db21f1"></a>CODE<br /><div class="outline-text-5" id="text-6-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #728aec;">R</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #A6E22E;">(</span><span style="color: #d66ab4;">f</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #728aec;">R</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">-</span><span style="color: #3f92f0;">r</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #728aec;">R</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org9daeb48"></a>ANS<br /><div class="outline-text-5" id="text-6-1-0-2">
<p>
(R<sup>6</sup>*pi<sup>2</sup>)/128
</p>
</div></li></ol>
</div>
<div id="outline-container-orgeca91c0" class="outline-3">
<h3 id="orgeca91c0"><span class="section-number-3">6.2</span> 2.</h3>
<div class="outline-text-3" id="text-6-2">
</div><ol class="org-ol"><li><a id="org444e479"></a>CODE<br /><div class="outline-text-5" id="text-6-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span> <span style="color: #00a7ba;">z</span>
<span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #00a7c3;">y</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #ae7ad7;">I2</span> <span style="color: #F92672;">=</span> <span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #a78f27;">sqrt</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7ba;">z</span> <span style="color: #F92672;">,</span><span style="color: #AE81FF;">0</span> <span style="color: #F92672;">,</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #42a356;">I</span> <span style="color: #F92672;">=</span> <span style="color: #3e92f1;">I1</span> <span style="color: #F92672;">+</span> <span style="color: #ae7ad7;">I2</span>
</pre>
</div>
</div></li>
<li><a id="org19afc4e"></a>ANS<br /><div class="outline-text-5" id="text-6-2-0-2">
<p>
(3*pi)/2
</p>
</div></li></ol>
</div>
<div id="outline-container-org45e5a5f" class="outline-3">
<h3 id="org45e5a5f"><span class="section-number-3">6.3</span> <span class="todo TODO">TODO</span> 3.</h3>
<div class="outline-text-3" id="text-6-3">
</div><ol class="org-ol"><li><a id="orga5f0167"></a>CODE<br /><div class="outline-text-5" id="text-6-3-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span> <span style="color: #00a7ba;">z</span>
</pre>
</div>
</div></li>
<li><a id="org3021ddd"></a>ANS<br /></li></ol>
</div>
<div id="outline-container-orgc9b9d3a" class="outline-3">
<h3 id="orgc9b9d3a"><span class="section-number-3">6.4</span> 4.</h3>
<div class="outline-text-3" id="text-6-4">
</div><ol class="org-ol"><li><a id="org8c314a1"></a>CODE<br /><div class="outline-text-5" id="text-6-4-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span>
<span style="color: #AE81FF;">3</span><span style="color: #F92672;">*</span><span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">*</span><span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">-</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">-</span><span style="color: #00a7c3;">y</span><span style="color: #A6E22E;">)</span><span style="color: #F92672;">,</span> <span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org9531fd0"></a>ANS<br /><div class="outline-text-5" id="text-6-4-0-2">
<p>
1/4
</p>
</div></li></ol>
</div>
<div id="outline-container-org6fa1e1a" class="outline-3">
<h3 id="org6fa1e1a"><span class="section-number-3">6.5</span> <span class="todo TODO">TODO</span> 5.</h3>
<div class="outline-text-3" id="text-6-5">
</div><div id="outline-container-org82b41a7" class="outline-4">
<h4 id="org82b41a7"><span class="section-number-4">6.5.1</span> (1)</h4>
<div class="outline-text-4" id="text-6-5-1">
</div><ol class="org-ol"><li><a id="org271f57d"></a>CODE<br /><div class="outline-text-5" id="text-6-5-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span>
</pre>
</div>
</div></li>
<li><a id="orgcea1ffa"></a>ANS<br /></li></ol>
</div>
<div id="outline-container-org2811729" class="outline-4">
<h4 id="org2811729"><span class="section-number-4">6.5.2</span> (2)</h4>
<div class="outline-text-4" id="text-6-5-2">
</div><ol class="org-ol"><li><a id="org3674c7f"></a>CODE<br /><div class="outline-text-5" id="text-6-5-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #dd724d;">x</span> <span style="color: #00a7c3;">y</span>
</pre>
</div>
</div></li>
<li><a id="orged68c8d"></a>ANS<br /></li></ol>
</div>
</div>
<div id="outline-container-org99bbfe4" class="outline-3">
<h3 id="org99bbfe4"><span class="section-number-3">6.6</span> 6.</h3>
<div class="outline-text-3" id="text-6-6">
</div><ol class="org-ol"><li><a id="orgfec07a2"></a>CODE<br /><div class="outline-text-5" id="text-6-6-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #c273c9;">syms</span> <span style="color: #3f92f0;">r</span> <span style="color: #d66ab4;">f</span> <span style="color: #e76868;">e</span>
<span style="color: #ba76d0;">int</span><span style="color: #AE81FF;">(</span><span style="color: #ba76d0;">int</span><span style="color: #66D9EF;">(</span><span style="color: #e76868;">e</span><span style="color: #F92672;">^</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #3f92f0;">r</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #e16f55;">pi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
