todo.org
**** CODE
#+BEGIN_SRC octave
clear
P1 = hygecf(10, 1000, 300, 50)
X = hygeinv(P1, 1000, 300, 50)
P2 = hygepdf(10, 1000, 300, 50)
x = 1:50;
Px1 = hygecdf(x, 1000, 300, 50);
Px2 = hygepdf(x, 1000, 300, 50);
stairs(x, Px1);
figure(1)
stairs(x, Px2);
#+END_SRC
*** 例2
**** CODE
#+BEGIN_SRC octave
clear
X = binornd(20, 0.2)
[p, pci] = binofit(X, 20)
#+END_SRC
*** 例3
**** CODE
#+BEGIN_SRC octave
clear
x = 0:20;
P1 = hygepdf(x, 2000, 30, 100);
P2 = binopdf(x, 100, 0.015);
P3 = poisspdf(x, 1.5);
subplot(3, 1, 1)
plot(x, P1, '+')
title('hygepdf');
subplot(3,1,2)
plot(x, P2, '*')
title('binopdf')
subplot('3,1,3')
plot(x, P3, '.')
title('poisspdf')
#+END_SRC
** 2.
**** CODE
#+BEGIN_SRC octave
clear
% 第一小题
P1 = binopdf(45, 100, 0.5)
P2 = binocdf(45, 100, 0.5)
% 第二小题
x = 0:100;
Px1 = binocdf(x, 100, 0.5);
Px2 = binopdf(x, 100, 0.5);
stairs(x, Px1);
figure(1)
stairs(x, Px2);
#+END_SRC
**** ANS
     p1 = 0.0485, p2 = 0.1841
* DONE 实验二十三
  CLOSED: [2017-03-22 Wed 16:36]
*** 计算各个统计量
