todo.html
<li><a id="org1d6d94a"></a>ANS<br /><div class="outline-text-5" id="text-6-6-0-2">
<p>
2*pi*e<sup>2</sup>
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org78aa456" class="outline-2">
<h2 id="org78aa456"><span class="section-number-2">7</span> <span class="done DONE">DONE</span> 实验十九</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org536af3f" class="outline-3">
<h3 id="org536af3f"><span class="section-number-3">7.1</span> 1.</h3>
<div class="outline-text-3" id="text-7-1">
</div><div id="outline-container-org7a4f54c" class="outline-4">
<h4 id="org7a4f54c"><span class="section-number-4">7.1.1</span> 例1</h4>
<div class="outline-text-4" id="text-7-1-1">
</div><ol class="org-ol"><li><a id="org4b290ab"></a>CODE<br /><div class="outline-text-5" id="text-7-1-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #0099f0;">P1</span> <span style="color: #F92672;">=</span> <span style="color: #00a790;">hygecf</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">10</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1000</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">300</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">50</span><span style="color: #AE81FF;">)</span>
<span style="color: #e66965;">X</span> <span style="color: #F92672;">=</span> <span style="color: #d77644;">hygeinv</span><span style="color: #AE81FF;">(</span><span style="color: #0099f0;">P1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1000</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">300</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">50</span><span style="color: #AE81FF;">)</span>
<span style="color: #0099f0;">P2</span> <span style="color: #F92672;">=</span> <span style="color: #e46497;">hygepdf</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">10</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1000</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">300</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">50</span><span style="color: #AE81FF;">)</span>
<span style="color: #dd724d;">x</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">50</span><span style="color: #F92672;">;</span>
<span style="color: #c273ca;">Px1</span> <span style="color: #F92672;">=</span> <span style="color: #00a3dd;">hygecdf</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1000</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">300</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">50</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #009aef;">Px2</span> <span style="color: #F92672;">=</span> <span style="color: #e46497;">hygepdf</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1000</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">300</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">50</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #9283e4;">stairs</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #c273ca;">Px1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #4e90f0;">figure</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
<span style="color: #9283e4;">stairs</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #009aef;">Px2</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-org8c548a6" class="outline-4">
<h4 id="org8c548a6"><span class="section-number-4">7.1.2</span> 例2</h4>
<div class="outline-text-4" id="text-7-1-2">
</div><ol class="org-ol"><li><a id="orgfce3642"></a>CODE<br /><div class="outline-text-5" id="text-7-1-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #e66965;">X</span> <span style="color: #F92672;">=</span> <span style="color: #52a14d;">binornd</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">20</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">[</span><span style="color: #00a7c3;">p</span><span style="color: #F92672;">,</span> <span style="color: #a98e27;">pci</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #be852d;">binofit</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">20</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgf1556e1" class="outline-4">
<h4 id="orgf1556e1"><span class="section-number-4">7.1.3</span> 例3</h4>
<div class="outline-text-4" id="text-7-1-3">
</div><ol class="org-ol"><li><a id="org2b4473a"></a>CODE<br /><div class="outline-text-5" id="text-7-1-3-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #dd724d;">x</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">20</span><span style="color: #F92672;">;</span>
<span style="color: #0099f0;">P1</span> <span style="color: #F92672;">=</span> <span style="color: #e46497;">hygepdf</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2000</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">30</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">100</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #0099f0;">P2</span> <span style="color: #F92672;">=</span> <span style="color: #00a56e;">binopdf</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">100</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">015</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #a49027;">P3</span> <span style="color: #F92672;">=</span> <span style="color: #8a85e6;">poisspdf</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
<span style="color: #e56494;">plot</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #0099f0;">P1</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'+'</span><span style="color: #AE81FF;">)</span>
<span style="color: #598fef;">title</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'hygepdf'</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
<span style="color: #e56494;">plot</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #0099f0;">P2</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'*'</span><span style="color: #AE81FF;">)</span>
<span style="color: #598fef;">title</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'binopdf'</span><span style="color: #AE81FF;">)</span>
<span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'3,1,3'</span><span style="color: #AE81FF;">)</span>
<span style="color: #e56494;">plot</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #a49027;">P3</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'.'</span><span style="color: #AE81FF;">)</span>
<span style="color: #598fef;">title</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'poisspdf'</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li></ol>
</div>
</div>
<div id="outline-container-org7c2f489" class="outline-3">
<h3 id="org7c2f489"><span class="section-number-3">7.2</span> 2.</h3>
<div class="outline-text-3" id="text-7-2">
</div><ol class="org-ol"><li><a id="org78e3b52"></a>CODE<br /><div class="outline-text-5" id="text-7-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #75715E;">% </span><span style="color: #75715E;">&#31532;&#19968;&#23567;&#39064;</span>
<span style="color: #0099f0;">P1</span> <span style="color: #F92672;">=</span> <span style="color: #00a56e;">binopdf</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">45</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">100</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span>
<span style="color: #0099f0;">P2</span> <span style="color: #F92672;">=</span> <span style="color: #37a35b;">binocdf</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">45</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">100</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span>
<span style="color: #75715E;">% </span><span style="color: #75715E;">&#31532;&#20108;&#23567;&#39064;</span>
<span style="color: #dd724d;">x</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">100</span><span style="color: #F92672;">;</span>
<span style="color: #c273ca;">Px1</span> <span style="color: #F92672;">=</span> <span style="color: #37a35b;">binocdf</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">100</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #009aef;">Px2</span> <span style="color: #F92672;">=</span> <span style="color: #00a56e;">binopdf</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">100</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #9283e4;">stairs</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #c273ca;">Px1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #4e90f0;">figure</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
<span style="color: #9283e4;">stairs</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #009aef;">Px2</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
</pre>
</div>
</div></li>
<li><a id="orga8e3b0d"></a>ANS<br /><div class="outline-text-5" id="text-7-2-0-2">
<p>
p1 = 0.0485, p2 = 0.1841
</p>
</div></li></ol>
</div>
</div>
