todo.org
**** CODE
#+BEGIN_SRC octave 
function showAll(X)
geomean(X)   % 几何均值
harmmean(X)  % 调和均值
meax(X)      % 算术平均值
median(X)    % 中位数
range(X)     % 极差
var(X)       % 方差
var(X, 1)    % 标准化方差
std(X)       % 标准差
cov(X)       % 协方差矩阵
moment(X, 1) % 1阶中心矩
moment(X, 2) % 2阶中心矩
moment(X, 3) % 3阶中心矩
moment(X, 4) % 4阶中心矩
corrcoef(X)  % 相关系数
end
#+END_SRC
*** 处理缺失数据
**** CODE
#+BEGIN_SRC octave 
function showLoss(X)
nansum(X)
nanmin(X)
nanmax(X)
nanmedian(X)
nanstd(X)
end
#+END_SRC
** 1.
**** CODE
#+BEGIN_SRC octave
% 输入矩阵
X1 = [ 1 2 4 2 ;...
      2 4 3 3 ;...
      3 3 4 4 ;...
      4 5 5 5 ]

showAll(X1) % 显示各个统计量
#+END_SRC
**** ANS
     太多了
** 2.
**** CODE
#+BEGIN_SRC octave
% 输入矩阵
X2 = (11-(1:10))' * (1:10)

showAll(X2) % 显示各个统计量
#+END_SRC
**** ANS
     太多了
** 3.
**** CODE
#+BEGIN_SRC octave
% 输入矩阵
m = magic(5);
rowNum = round(5*rand());
m(rowNum,:) = repmat([NaN], 1, 5);

showLoss(m) % 显示各个统计量
#+END_SRC
**** ANS
     太多了
* DONE 实验三十
  CLOSED: [2017-03-22 Wed 17:30]
** 1.
**** CODE
#+BEGIN_SRC octave
% 输入矩阵
X = [0.1 0.8 1.3 1.9 2.5 3.1]
y = [1.2 1.6 2.7 2.0 1.3 0.5]

% 线性插值
y1 = interp1(X, y, 2.0, 'linear')

% 三次插值
y2 = interp1(X, y, 2.0, 'pchip')       % 'cubic'将被'pchip'取代
#+END_SRC
**** ANS
     线性插值 -> y1 = 1.8833
     三次插值 -> y2 = 1.8844
** 2.
