todo.html
<div id="outline-container-orgd6d8ab6" class="outline-2">
<h2 id="orgd6d8ab6"><span class="section-number-2">8</span> <span class="done DONE">DONE</span> 实验二十三</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgfe4aff0" class="outline-4">
<h4 id="orgfe4aff0"><span class="section-number-4">8.0.1</span> 计算各个统计量</h4>
<div class="outline-text-4" id="text-8-0-1">
</div><ol class="org-ol"><li><a id="org941711b"></a>CODE<br /><div class="outline-text-5" id="text-8-0-1-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #de714f;">function</span> <span style="color: #e16f54;">showAll</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
<span style="color: #ad7ad8;">geomean</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>   <span style="color: #75715E;">% &#20960;&#20309;&#22343;&#20540;</span>
<span style="color: #d87546;">harmmean</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>  <span style="color: #75715E;">% &#35843;&#21644;&#22343;&#20540;</span>
<span style="color: #a19127;">meax</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>      <span style="color: #75715E;">% &#31639;&#26415;&#24179;&#22343;&#20540;</span>
<span style="color: #9a9328;">median</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>    <span style="color: #75715E;">% &#20013;&#20301;&#25968;</span>
<span style="color: #a49027;">range</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>     <span style="color: #75715E;">% &#26497;&#24046;</span>
<span style="color: #36a35c;">var</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>       <span style="color: #75715E;">% &#26041;&#24046;</span>
<span style="color: #36a35c;">var</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>    <span style="color: #75715E;">% &#26631;&#20934;&#21270;&#26041;&#24046;</span>
<span style="color: #d77645;">std</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>       <span style="color: #75715E;">% &#26631;&#20934;&#24046;</span>
<span style="color: #009eea;">cov</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>       <span style="color: #75715E;">% &#21327;&#26041;&#24046;&#30697;&#38453;</span>
<span style="color: #4aa252;">moment</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">% 1&#38454;&#20013;&#24515;&#30697;</span>
<span style="color: #4aa252;">moment</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">% 2&#38454;&#20013;&#24515;&#30697;</span>
<span style="color: #4aa252;">moment</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">% 3&#38454;&#20013;&#24515;&#30697;</span>
<span style="color: #4aa252;">moment</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">% 4&#38454;&#20013;&#24515;&#30697;</span>
<span style="color: #00a56b;">corrcoef</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>  <span style="color: #75715E;">% &#30456;&#20851;&#31995;&#25968;</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgc07ef24" class="outline-4">
<h4 id="orgc07ef24"><span class="section-number-4">8.0.2</span> 处理缺失数据</h4>
<div class="outline-text-4" id="text-8-0-2">
</div><ol class="org-ol"><li><a id="org78d1c56"></a>CODE<br /><div class="outline-text-5" id="text-8-0-2-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #de714f;">function</span> <span style="color: #00a892;">showLoss</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
<span style="color: #658dee;">nansum</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
<span style="color: #009bef;">nanmin</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
<span style="color: #00a6cc;">nanmax</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
<span style="color: #00a8a9;">nanmedian</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
<span style="color: #00a67a;">nanstd</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgde58879" class="outline-3">
<h3 id="orgde58879"><span class="section-number-3">8.1</span> 1.</h3>
<div class="outline-text-3" id="text-8-1">
</div><ol class="org-ol"><li><a id="orgf1c8e35"></a>CODE<br /><div class="outline-text-5" id="text-8-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #75715E;">% </span><span style="color: #75715E;">&#36755;&#20837;&#30697;&#38453;</span>
<span style="color: #e96384;">X1</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">2</span> <span style="color: #F92672;">;...</span>
      <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">3</span> <span style="color: #F92672;">;...</span>
      <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">4</span> <span style="color: #F92672;">;...</span>
      <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">]</span>

<span style="color: #e16f54;">showAll</span><span style="color: #AE81FF;">(</span><span style="color: #e96384;">X1</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">% &#26174;&#31034;&#21508;&#20010;&#32479;&#35745;&#37327;</span>
</pre>
</div>
</div></li>
<li><a id="orgf2e4545"></a>ANS<br /><div class="outline-text-5" id="text-8-1-0-2">
<p>
太多了
</p>
</div></li></ol>
</div>
<div id="outline-container-org96a8473" class="outline-3">
<h3 id="org96a8473"><span class="section-number-3">8.2</span> 2.</h3>
<div class="outline-text-3" id="text-8-2">
</div><ol class="org-ol"><li><a id="orgf8dd8b4"></a>CODE<br /><div class="outline-text-5" id="text-8-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #75715E;">% </span><span style="color: #75715E;">&#36755;&#20837;&#30697;&#38453;</span>
<span style="color: #009eec;">X2</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">11</span><span style="color: #F92672;">-</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">10</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">'</span> <span style="color: #F92672;">*</span> <span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">)</span>

<span style="color: #e16f54;">showAll</span><span style="color: #AE81FF;">(</span><span style="color: #009eec;">X2</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">% &#26174;&#31034;&#21508;&#20010;&#32479;&#35745;&#37327;</span>
</pre>
</div>
</div></li>
<li><a id="orgfc026d0"></a>ANS<br /><div class="outline-text-5" id="text-8-2-0-2">
<p>
太多了
</p>
</div></li></ol>
</div>
<div id="outline-container-org260967d" class="outline-3">
<h3 id="org260967d"><span class="section-number-3">8.3</span> 3.</h3>
<div class="outline-text-3" id="text-8-3">
</div><ol class="org-ol"><li><a id="orgd14409a"></a>CODE<br /><div class="outline-text-5" id="text-8-3-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #75715E;">% </span><span style="color: #75715E;">&#36755;&#20837;&#30697;&#38453;</span>
<span style="color: #00a7c2;">m</span> <span style="color: #F92672;">=</span> <span style="color: #e76966;">magic</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #e8676b;">rowNum</span> <span style="color: #F92672;">=</span> <span style="color: #90962b;">round</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">5</span><span style="color: #F92672;">*</span><span style="color: #9f7fdf;">rand</span><span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #00a7c2;">m</span><span style="color: #AE81FF;">(</span><span style="color: #e8676b;">rowNum</span><span style="color: #F92672;">,:</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">=</span> <span style="color: #e26d58;">repmat</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #e36c5b;">NaN</span><span style="color: #66D9EF;">]</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>

<span style="color: #00a892;">showLoss</span><span style="color: #AE81FF;">(</span><span style="color: #00a7c2;">m</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">% &#26174;&#31034;&#21508;&#20010;&#32479;&#35745;&#37327;</span>
</pre>
</div>
</div></li>
<li><a id="org74370dc"></a>ANS<br /><div class="outline-text-5" id="text-8-3-0-2">
<p>
太多了
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org584140c" class="outline-2">
<h2 id="org584140c"><span class="section-number-2">9</span> <span class="done DONE">DONE</span> 实验三十</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgd8cdee8" class="outline-3">
<h3 id="orgd8cdee8"><span class="section-number-3">9.1</span> 1.</h3>
<div class="outline-text-3" id="text-9-1">
</div><ol class="org-ol"><li><a id="org54c4e54"></a>CODE<br /><div class="outline-text-5" id="text-9-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #75715E;">% </span><span style="color: #75715E;">&#36755;&#20837;&#30697;&#38453;</span>
<span style="color: #e66965;">X</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">8</span> <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">9</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">3</span>.<span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
<span style="color: #00a7c3;">y</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">6</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">]</span>

<span style="color: #75715E;">% </span><span style="color: #75715E;">&#32447;&#24615;&#25554;&#20540;</span>
<span style="color: #758aeb;">y1</span> <span style="color: #F92672;">=</span> <span style="color: #a78f27;">interp1</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'linear'</span><span style="color: #AE81FF;">)</span>

<span style="color: #75715E;">% </span><span style="color: #75715E;">&#19977;&#27425;&#25554;&#20540;</span>
<span style="color: #d47940;">y2</span> <span style="color: #F92672;">=</span> <span style="color: #a78f27;">interp1</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">0</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'pchip'</span><span style="color: #AE81FF;">)</span>       <span style="color: #75715E;">% 'cubic'&#23558;&#34987;'pchip'&#21462;&#20195;</span>
</pre>
</div>
</div></li>
