todo.org
**** CODE
#+BEGIN_SRC octave
clear
% 输入矩阵
x = 0:4;
y = 0:4;
t = [ 4 0 -4 0 4 ; ...
      3 2 -2 2 3 ; ...
      2 1  0 1 2 ; ...
      3 2 -2 2 3 ; ...
      4 0 -4 0 4 ];

% 原始网格图
subplot(1, 2, 1)
mesh(x, y, t)

% 网格细化图
x1 = 0: 0.1: 4;
y1 = 0: 0.1: 4;
[x2 y2] = meshgrid(x1, y1);
t1 = interp2(x, y, t, x2, y2, 'linear');
subplot(1, 2, 2)
mesh(x1, y1, t1)
#+END_SRC
**** ANS
     图片暂无
** 3.
**** CODE
#+BEGIN_SRC octave
clear
[X,Y,Z,V] = flow(10); 

Xi = 10*rand();
Yi = -3+6*rand();
Zi = -3+6*rand();

Vi = interp3(X,Y,Z,V,Xi,Yi,Zi)
#+END_SRC
**** ANS
     -4.9971
* DONE 实验三十一
  CLOSED: [2017-03-22 Wed 18:28]
** 1.
**** CODE
#+BEGIN_SRC octave
clear
% 输入数据
x = [1.2 1.8 2.1 2.4 2.6 3.0 3.3];
y = [4.85 5.2 5.6 6.2 6.5 7.0 7.5];

% 分别生成4,5,6阶的拟合曲线
for n = 4:6
  p = polyfit(x, y, n);
  x1 = 1:0.05:3;
  y1 = polyval(p, x1);
  subplot(1,3,n-3)
  plot(x, y, ' * ', x1, y1, ':')
end
#+END_SRC
**** ANS
     图略
** 2.
