todo.html
<li><a id="org3292f78"></a>ANS<br /><div class="outline-text-5" id="text-9-1-0-2">
<p>
线性插值 -&gt; y1 = 1.8833
三次插值 -&gt; y2 = 1.8844
</p>
</div></li></ol>
</div>
<div id="outline-container-org9311eed" class="outline-3">
<h3 id="org9311eed"><span class="section-number-3">9.2</span> 2.</h3>
<div class="outline-text-3" id="text-9-2">
</div><ol class="org-ol"><li><a id="orgf8774a8"></a>CODE<br /><div class="outline-text-5" id="text-9-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #75715E;">% </span><span style="color: #75715E;">&#36755;&#20837;&#30697;&#38453;</span>
<span style="color: #dd724d;">x</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">;</span>
<span style="color: #00a7c3;">y</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">4</span><span style="color: #F92672;">;</span>
<span style="color: #7e9a33;">t</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">0</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">4</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
      <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">2</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">3</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
      <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">1</span>  <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">2</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
      <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">2</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">3</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
      <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">0</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>

<span style="color: #75715E;">% </span><span style="color: #75715E;">&#21407;&#22987;&#32593;&#26684;&#22270;</span>
<span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
<span style="color: #0097f1;">mesh</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #AE81FF;">)</span>

<span style="color: #75715E;">% </span><span style="color: #75715E;">&#32593;&#26684;&#32454;&#21270;&#22270;</span>
<span style="color: #00a789;">x1</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span> <span style="color: #AE81FF;">4</span><span style="color: #F92672;">;</span>
<span style="color: #758aeb;">y1</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span> <span style="color: #AE81FF;">4</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #7789eb;">x2</span> <span style="color: #d47940;">y2</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #c68133;">meshgrid</span><span style="color: #AE81FF;">(</span><span style="color: #00a789;">x1</span><span style="color: #F92672;">,</span> <span style="color: #758aeb;">y1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #00a5cf;">t1</span> <span style="color: #F92672;">=</span> <span style="color: #e4649a;">interp2</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #7e9a33;">t</span><span style="color: #F92672;">,</span> <span style="color: #7789eb;">x2</span><span style="color: #F92672;">,</span> <span style="color: #d47940;">y2</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'linear'</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
<span style="color: #0097f1;">mesh</span><span style="color: #AE81FF;">(</span><span style="color: #00a789;">x1</span><span style="color: #F92672;">,</span> <span style="color: #758aeb;">y1</span><span style="color: #F92672;">,</span> <span style="color: #00a5cf;">t1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org554ae13"></a>ANS<br /><div class="outline-text-5" id="text-9-2-0-2">
<p>
图片暂无
</p>
</div></li></ol>
</div>
<div id="outline-container-orgcbe937c" class="outline-3">
<h3 id="orgcbe937c"><span class="section-number-3">9.3</span> 3.</h3>
<div class="outline-text-3" id="text-9-3">
</div><ol class="org-ol"><li><a id="org10a570b"></a>CODE<br /><div class="outline-text-5" id="text-9-3-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #AE81FF;">[</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span><span style="color: #6b9e3e;">Y</span><span style="color: #F92672;">,</span><span style="color: #8087e9;">Z</span><span style="color: #F92672;">,</span><span style="color: #e46c5c;">V</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #e8676c;">flow</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span> 

<span style="color: #9c9228;">Xi</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">10</span><span style="color: #F92672;">*</span><span style="color: #9f7fdf;">rand</span><span style="color: #AE81FF;">()</span><span style="color: #F92672;">;</span>
<span style="color: #c372c8;">Yi</span> <span style="color: #F92672;">=</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">6</span><span style="color: #F92672;">*</span><span style="color: #9f7fdf;">rand</span><span style="color: #AE81FF;">()</span><span style="color: #F92672;">;</span>
<span style="color: #739d3a;">Zi</span> <span style="color: #F92672;">=</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">6</span><span style="color: #F92672;">*</span><span style="color: #9f7fdf;">rand</span><span style="color: #AE81FF;">()</span><span style="color: #F92672;">;</span>

<span style="color: #00a6cc;">Vi</span> <span style="color: #F92672;">=</span> <span style="color: #3ba35a;">interp3</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span><span style="color: #6b9e3e;">Y</span><span style="color: #F92672;">,</span><span style="color: #8087e9;">Z</span><span style="color: #F92672;">,</span><span style="color: #e46c5c;">V</span><span style="color: #F92672;">,</span><span style="color: #9c9228;">Xi</span><span style="color: #F92672;">,</span><span style="color: #c372c8;">Yi</span><span style="color: #F92672;">,</span><span style="color: #739d3a;">Zi</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgba9e708"></a>ANS<br /><div class="outline-text-5" id="text-9-3-0-2">
<p>
-4.9971
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-orgf50f21d" class="outline-2">
<h2 id="orgf50f21d"><span class="section-number-2">10</span> <span class="done DONE">DONE</span> 实验三十一</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org33f85ac" class="outline-3">
<h3 id="org33f85ac"><span class="section-number-3">10.1</span> 1.</h3>
<div class="outline-text-3" id="text-10-1">
</div><ol class="org-ol"><li><a id="orgfc6b69e"></a>CODE<br /><div class="outline-text-5" id="text-10-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #75715E;">% </span><span style="color: #75715E;">&#36755;&#20837;&#25968;&#25454;</span>
<span style="color: #dd724d;">x</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">8</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">2</span>.<span style="color: #AE81FF;">6</span> <span style="color: #AE81FF;">3</span>.<span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">3</span>.<span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #00a7c3;">y</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">4</span>.<span style="color: #AE81FF;">85</span> <span style="color: #AE81FF;">5</span>.<span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">5</span>.<span style="color: #AE81FF;">6</span> <span style="color: #AE81FF;">6</span>.<span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">6</span>.<span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">7</span>.<span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">7</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>

<span style="color: #75715E;">% </span><span style="color: #75715E;">&#20998;&#21035;&#29983;&#25104;4,5,6&#38454;&#30340;&#25311;&#21512;&#26354;&#32447;</span>
<span style="color: #00a2e0;">for</span> <span style="color: #0097f1;">n</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">4</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">6</span>
  <span style="color: #00a7c3;">p</span> <span style="color: #F92672;">=</span> <span style="color: #e96577;">polyfit</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #0097f1;">n</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #00a789;">x1</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">05</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">;</span>
  <span style="color: #758aeb;">y1</span> <span style="color: #F92672;">=</span> <span style="color: #5fa046;">polyval</span><span style="color: #AE81FF;">(</span><span style="color: #00a7c3;">p</span><span style="color: #F92672;">,</span> <span style="color: #00a789;">x1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span><span style="color: #AE81FF;">3</span><span style="color: #F92672;">,</span><span style="color: #0097f1;">n</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
  <span style="color: #e56494;">plot</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">' * '</span><span style="color: #F92672;">,</span> <span style="color: #00a789;">x1</span><span style="color: #F92672;">,</span> <span style="color: #758aeb;">y1</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">':'</span><span style="color: #AE81FF;">)</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div></li>
