todo.html
<li><a id="orgf79b72c"></a>ANS<br /><div class="outline-text-5" id="text-10-1-0-2">
<p>
图略
</p>
</div></li></ol>
</div>
<div id="outline-container-org505cc8e" class="outline-3">
<h3 id="org505cc8e"><span class="section-number-3">10.2</span> 2.</h3>
<div class="outline-text-3" id="text-10-2">
</div><ol class="org-ol"><li><a id="orgdebb323"></a>CODE<br /><div class="outline-text-5" id="text-10-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #75715E;">% </span><span style="color: #75715E;">&#36755;&#20837;&#25968;&#25454;</span>
<span style="color: #e66965;">X</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">24</span><span style="color: #F92672;">;</span>
<span style="color: #00a7c3;">y</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">15</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">15</span> <span style="color: #AE81FF;">16</span> <span style="color: #AE81FF;">18</span> <span style="color: #AE81FF;">20</span> <span style="color: #AE81FF;">22</span> <span style="color: #AE81FF;">23</span> <span style="color: #AE81FF;">25</span> <span style="color: #AE81FF;">28</span> <span style="color: #F92672;">...</span>
     <span style="color: #AE81FF;">31</span> <span style="color: #AE81FF;">32</span> <span style="color: #AE81FF;">31</span> <span style="color: #AE81FF;">29</span> <span style="color: #AE81FF;">27</span> <span style="color: #AE81FF;">25</span> <span style="color: #AE81FF;">24</span> <span style="color: #AE81FF;">22</span> <span style="color: #AE81FF;">20</span> <span style="color: #AE81FF;">18</span> <span style="color: #AE81FF;">17</span> <span style="color: #AE81FF;">16</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>

<span style="color: #75715E;">% </span><span style="color: #75715E;">&#20998;&#21035;&#29983;&#25104;2,3,4&#38454;&#30340;&#25311;&#21512;&#26354;&#32447;</span>
<span style="color: #00a2e0;">for</span> <span style="color: #0097f1;">n</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">4</span>
  <span style="color: #00a7c3;">p</span> <span style="color: #F92672;">=</span> <span style="color: #e96577;">polyfit</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #0097f1;">n</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #e96384;">X1</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">05</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">24</span><span style="color: #F92672;">;</span>
  <span style="color: #758aeb;">y1</span> <span style="color: #F92672;">=</span> <span style="color: #5fa046;">polyval</span><span style="color: #AE81FF;">(</span><span style="color: #00a7c3;">p</span><span style="color: #F92672;">,</span> <span style="color: #e96384;">X1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">4</span><span style="color: #F92672;">,</span> <span style="color: #0097f1;">n</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
  <span style="color: #e56494;">plot</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">' * '</span><span style="color: #F92672;">,</span> <span style="color: #e96384;">X1</span><span style="color: #F92672;">,</span> <span style="color: #758aeb;">y1</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">':'</span><span style="color: #AE81FF;">)</span>
<span style="color: #c074cb;">end</span>

<span style="color: #75715E;">% </span><span style="color: #75715E;">&#29983;&#25104;&#38750;&#32447;&#24615;&#25311;&#21512;&#26354;&#32447;</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #c472c8;">inline</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'c(1)*exp(-c(2)*(x-c(3)).^2)'</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'c'</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">'x'</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #ba872b;">init_theta</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #6d9e3d;">Theta</span> <span style="color: #F92672;">=</span> <span style="color: #e066a2;">lsqcurvefit</span><span style="color: #AE81FF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #ba872b;">init_theta</span><span style="color: #F92672;">,</span> <span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #AE81FF;">)</span>
<span style="color: #e96384;">X1</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">05</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">24</span><span style="color: #F92672;">;</span>
<span style="color: #758aeb;">y1</span> <span style="color: #F92672;">=</span> <span style="color: #00a3dd;">feval</span><span style="color: #AE81FF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #6d9e3d;">Theta</span><span style="color: #F92672;">,</span> <span style="color: #e96384;">X1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #8586e8;">subplot</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">4</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">)</span>
<span style="color: #e56494;">plot</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #00a7c3;">y</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">' * '</span><span style="color: #F92672;">,</span> <span style="color: #e96384;">X1</span><span style="color: #F92672;">,</span> <span style="color: #758aeb;">y1</span><span style="color: #F92672;">,</span> <span style="color: #E6DB74;">':'</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orga289a98"></a>ANS<br /><div class="outline-text-5" id="text-10-2-0-2">
<p>
图片略
</p>
</div></li>
<li><a id="orge3ec3eb"></a>NOTES<br /><div class="outline-text-5" id="text-10-2-0-3">
<p>
lsqcurvefit函数根据初始值不同会获得不同的局部最优解
随机生成初始值，多次求解最优解
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org465a841" class="outline-2">
<h2 id="org465a841"><span class="section-number-2">11</span> <span class="done DONE">DONE</span> 实验三十四</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgce7ca27" class="outline-3">
<h3 id="orgce7ca27"><span class="section-number-3">11.1</span> 1.</h3>
<div class="outline-text-3" id="text-11-1">
</div><ol class="org-ol"><li><a id="org8e4330b"></a>CODE<br /><div class="outline-text-5" id="text-11-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #00a6ca;">fun</span> <span style="color: #F92672;">=</span> <span style="color: #c472c8;">inline</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'x-exp(-x)'</span><span style="color: #F92672;">,</span><span style="color: #E6DB74;">'x'</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #4691f0;">fsolve</span><span style="color: #AE81FF;">(</span><span style="color: #00a6ca;">fun</span><span style="color: #F92672;">,</span> <span style="color: #66D9EF;">[</span><span style="color: #9f7fdf;">rand</span><span style="color: #A6E22E;">()</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org592ad63"></a>ANS<br /><div class="outline-text-5" id="text-11-1-0-2">
<p>
0.5671
</p>
</div></li></ol>
</div>
<div id="outline-container-orgb16d8c8" class="outline-3">
<h3 id="orgb16d8c8"><span class="section-number-3">11.2</span> 2.</h3>
<div class="outline-text-3" id="text-11-2">
</div><ol class="org-ol"><li><a id="orgc083b17"></a>CODE<br /><div class="outline-text-5" id="text-11-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #00a6ca;">fun</span> <span style="color: #F92672;">=</span> <span style="color: #c472c8;">inline</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'5*x^2*sin(x)-exp(-x)'</span><span style="color: #F92672;">,</span><span style="color: #E6DB74;">'x'</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #00a2e0;">for</span> <span style="color: #a39027;">i</span><span style="color: #F92672;">=</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">10</span>
<span style="color: #4691f0;">fsolve</span><span style="color: #AE81FF;">(</span><span style="color: #00a6ca;">fun</span><span style="color: #F92672;">,</span> <span style="color: #66D9EF;">[</span><span style="color: #a39027;">i</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div></li>
