todo.org
**** CODE
#+BEGIN_SRC octave
% 方程组转为函数
function y = gg(x)
y(1) = x(1)-0.7*sin(x(1))-0.2*cos(x(2));
y(2) = x(2)-0.7*cos(x(1))-0.2*sin(x(2));
end

clear
format short
x0 = [0.1 0.1]
fsolve(@gg, x0)
#+END_SRC
**** ANS
     x = 0.4442
     y = 0.7715
** 4.
**** CODE
#+BEGIN_SRC octave
clear
fun = inline('x^2*exp(-x^2)-0.2','x');
for i=-15:-15
fsolve(fun, [i])
end
#+END_SRC
**** ANS
     x1 =  0.5091
     x2 = -0.5091
     x3 =  1.5946
     x4 = -1.5946
* DONE 实验三十五
  CLOSED: [2017-03-22 Wed 20:26]
** 1.
**** CODE
#+BEGIN_SRC octave
clear
f = [ 3  2 -8  5 ];
A = [ 3 -6  5 -2 ; ...
     -7  3  1 -3 ];
b = [-3 -1];
Aeq = [1 8 1 -1];
Beq = [-2];
LB = [0; -Inf; 0; -Inf];
[X, fval] = linprog(f, A, b, Aeq, Beq, LB)
#+END_SRC
**** ANS
     x1 =  0.0000
     x2 = -0.0455
     x3 =  0.0000
     x4 =  1.6364
     fval = 8.0909
** 2.
**** CODE
#+BEGIN_SRC octave
clear
f = [ -1 1 1 1 -1 ];
Aeq = [0  0 1 0 6 ; ...
       1 -4 0 0 2 ; ...
       0  2 0 1 2];
Beq = [9 2 9];
LB = zeros(1, 5);
[X, fval] = linprog(f, [], [], Aeq, Beq, LB)
#+END_SRC
**** ANS
     x1 = 11
     x2 = 3
     x3 = 0
     x4 = 0
     x5 = 1.5
     fval = -9.5
** 3.
