todo.html
<li><a id="org705b317"></a>ANS<br /><div class="outline-text-5" id="text-11-2-0-2">
<p>
0.5671
</p>
</div></li></ol>
</div>
<div id="outline-container-org9b5dc91" class="outline-3">
<h3 id="org9b5dc91"><span class="section-number-3">11.3</span> 3.</h3>
<div class="outline-text-3" id="text-11-3">
</div><ol class="org-ol"><li><a id="orga5d68f2"></a>CODE<br /><div class="outline-text-5" id="text-11-3-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #75715E;">% </span><span style="color: #75715E;">&#26041;&#31243;&#32452;&#36716;&#20026;&#20989;&#25968;</span>
<span style="color: #de714f;">function</span> <span style="color: #00a7c3;">y</span> <span style="color: #F92672;">=</span> <span style="color: #c58132;">gg</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #AE81FF;">)</span>
<span style="color: #00a7c3;">y</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">=</span> <span style="color: #dd724d;">x</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">7</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #00a7c3;">y</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">=</span> <span style="color: #dd724d;">x</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">7</span><span style="color: #F92672;">*</span><span style="color: #dc734b;">cos</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #0098f0;">sin</span><span style="color: #AE81FF;">(</span><span style="color: #dd724d;">x</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #c074cb;">end</span>

<span style="color: #00a8a8;">clear</span>
<span style="color: #00a673;">format</span> <span style="color: #e76966;">short</span>
<span style="color: #cb7e37;">x0</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
<span style="color: #4691f0;">fsolve</span><span style="color: #AE81FF;">(</span>@<span style="color: #c58132;">gg</span><span style="color: #F92672;">,</span> <span style="color: #cb7e37;">x0</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org193ccf6"></a>ANS<br /><div class="outline-text-5" id="text-11-3-0-2">
<p>
x = 0.4442
y = 0.7715
</p>
</div></li></ol>
</div>
<div id="outline-container-orga543b0c" class="outline-3">
<h3 id="orga543b0c"><span class="section-number-3">11.4</span> 4.</h3>
<div class="outline-text-3" id="text-11-4">
</div><ol class="org-ol"><li><a id="orgcda4470"></a>CODE<br /><div class="outline-text-5" id="text-11-4-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #00a6ca;">fun</span> <span style="color: #F92672;">=</span> <span style="color: #c472c8;">inline</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'x^2*exp(-x^2)-0.2'</span><span style="color: #F92672;">,</span><span style="color: #E6DB74;">'x'</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #00a2e0;">for</span> <span style="color: #a39027;">i</span><span style="color: #F92672;">=-</span><span style="color: #AE81FF;">15</span><span style="color: #F92672;">:-</span><span style="color: #AE81FF;">15</span>
<span style="color: #4691f0;">fsolve</span><span style="color: #AE81FF;">(</span><span style="color: #00a6ca;">fun</span><span style="color: #F92672;">,</span> <span style="color: #66D9EF;">[</span><span style="color: #a39027;">i</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div></li>
<li><a id="orgd002b8b"></a>ANS<br /><div class="outline-text-5" id="text-11-4-0-2">
<p>
x1 =  0.5091
x2 = -0.5091
x3 =  1.5946
x4 = -1.5946
</p>
</div></li></ol>
</div>
</div>
<div id="outline-container-org0efb85f" class="outline-2">
<h2 id="org0efb85f"><span class="section-number-2">12</span> <span class="done DONE">DONE</span> 实验三十五</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgc4c420a" class="outline-3">
<h3 id="orgc4c420a"><span class="section-number-3">12.1</span> 1.</h3>
<div class="outline-text-3" id="text-12-1">
</div><ol class="org-ol"><li><a id="orgc3544fb"></a>CODE<br /><div class="outline-text-5" id="text-12-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span> <span style="color: #AE81FF;">3</span>  <span style="color: #AE81FF;">2</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">8</span>  <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #e16f55;">A</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span> <span style="color: #AE81FF;">3</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">6</span>  <span style="color: #AE81FF;">5</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
     <span style="color: #F92672;">-</span><span style="color: #AE81FF;">7</span>  <span style="color: #AE81FF;">3</span>  <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #00a7b3;">b</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">3</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #0096f1;">Aeq</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">8</span> <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #ac7bd9;">Beq</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #00a0e7;">LB</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #F92672;">;</span> <span style="color: #F92672;">-</span><span style="color: #00a7bd;">Inf</span><span style="color: #F92672;">;</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">;</span> <span style="color: #F92672;">-</span><span style="color: #00a7bd;">Inf</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #e96573;">fval</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #00a7c0;">linprog</span><span style="color: #AE81FF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">A</span><span style="color: #F92672;">,</span> <span style="color: #00a7b3;">b</span><span style="color: #F92672;">,</span> <span style="color: #0096f1;">Aeq</span><span style="color: #F92672;">,</span> <span style="color: #ac7bd9;">Beq</span><span style="color: #F92672;">,</span> <span style="color: #00a0e7;">LB</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="orgf005ca9"></a>ANS<br /><div class="outline-text-5" id="text-12-1-0-2">
<p>
x1 =  0.0000
x2 = -0.0455
x3 =  0.0000
x4 =  1.6364
fval = 8.0909
</p>
</div></li></ol>
</div>
<div id="outline-container-orge807134" class="outline-3">
<h3 id="orge807134"><span class="section-number-3">12.2</span> 2.</h3>
<div class="outline-text-3" id="text-12-2">
</div><ol class="org-ol"><li><a id="org213d79e"></a>CODE<br /><div class="outline-text-5" id="text-12-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #0096f1;">Aeq</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">0</span>  <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">6</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">2</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">0</span>  <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #ac7bd9;">Beq</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">9</span> <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">9</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #00a0e7;">LB</span> <span style="color: #F92672;">=</span> <span style="color: #00a5d4;">zeros</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #e96573;">fval</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #00a7c0;">linprog</span><span style="color: #AE81FF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #66D9EF;">[]</span><span style="color: #F92672;">,</span> <span style="color: #66D9EF;">[]</span><span style="color: #F92672;">,</span> <span style="color: #0096f1;">Aeq</span><span style="color: #F92672;">,</span> <span style="color: #ac7bd9;">Beq</span><span style="color: #F92672;">,</span> <span style="color: #00a0e7;">LB</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
