todo.org
**** CODE
#+BEGIN_SRC octave
clear
f = [1 1 1 1 1 1 1];
A = [1 0 0 1 1 1 1 ; ...
     1 1 0 0 1 1 1 ; ...
     1 1 1 0 0 1 1 ; ...
     1 1 1 1 0 0 1 ; ...
     1 1 1 1 1 0 0 ; ...
     0 1 1 1 1 1 0 ; ...
     0 0 1 1 1 1 1 ]*(-1);
b = [16 15 16 19 14 12 18]*(-1);
LB = zeros(1, 7);
[X, fval] = linprog(f, A, b, [], [], LB)
#+END_SRC
**** ANS
     x1 = 2
     x2 = 2
     x3 = 4
     x4 = 3
     x5 = 3
     x6 = 0
     x7 = 8
     fval = 22
     开销为2200元

* DONE 实验三十六
  CLOSED: [2017-03-22 Wed 20:26]
** 1.
**** CODE
#+BEGIN_SRC octave
clear
fun = '(x^5+x^3+x^2-1)/(exp(x^2)+sin(-x))';
[X fval exitflag output] = fminbnd(fun, -5, 5)
#+END_SRC
**** ANS
     正确，不同的约束条件导致不同的最优化函数，在算法进行求导时，约束条件会改变当某个变量的偏导数为0时变量的值
** 2.
**** CODE
#+BEGIN_SRC octave
clear
fun = 'x^2+4*x+4';
[X fval exitflag output] = fminsearch(fun, 0)
#+END_SRC
**** ANS
     -2
** 3.
**** CODE
#+BEGIN_SRC octave
clear
fun = '(x-2)^4*sin(x)-(x-1)^2*cos(x)';
[X fval exitflag output] = fminbnd(fun, -10, 10)
#+END_SRC
**** ANS
      f(min) = f(-2.2939) = -247.6956
* DONE 实验三十七
  CLOSED: [2017-03-22 Wed 20:26]
** 1.
**** CODE
#+BEGIN_SRC octave
% 目标函数
function f = objfun(x)
f = 1/3*(x(1)+1)^3+x(2);
end

% 求解最优化问题
clear
x0 = [1 1];
A = [-1  0 ; ...
      0 -1 ];
b = [-1 0];
[x fval exitflag output] = fmincon(@objfun, x0, A, b)
#+END_SRC
**** ANS
     x1 = 1
     x2 = 0
     fval = 2.6667
** 2.
