todo.html
<li><a id="org3b434d5"></a>ANS<br /><div class="outline-text-5" id="text-12-2-0-2">
<p>
x1 = 11
x2 = 3
x3 = 0
x4 = 0
x5 = 1.5
fval = -9.5
</p>
</div></li></ol>
</div>
<div id="outline-container-org037047f" class="outline-3">
<h3 id="org037047f"><span class="section-number-3">12.3</span> 3.</h3>
<div class="outline-text-3" id="text-12-3">
</div><ol class="org-ol"><li><a id="orgb4115a1"></a>CODE<br /><div class="outline-text-5" id="text-12-3-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #d66ab4;">f</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
<span style="color: #e16f55;">A</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
     <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
     <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
     <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
     <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">0</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
     <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">0</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
     <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">*</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #00a7b3;">b</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">16</span> <span style="color: #AE81FF;">15</span> <span style="color: #AE81FF;">16</span> <span style="color: #AE81FF;">19</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">18</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">*</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #00a0e7;">LB</span> <span style="color: #F92672;">=</span> <span style="color: #00a5d4;">zeros</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">7</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #e66965;">X</span><span style="color: #F92672;">,</span> <span style="color: #e96573;">fval</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #00a7c0;">linprog</span><span style="color: #AE81FF;">(</span><span style="color: #d66ab4;">f</span><span style="color: #F92672;">,</span> <span style="color: #e16f55;">A</span><span style="color: #F92672;">,</span> <span style="color: #00a7b3;">b</span><span style="color: #F92672;">,</span> <span style="color: #66D9EF;">[]</span><span style="color: #F92672;">,</span> <span style="color: #66D9EF;">[]</span><span style="color: #F92672;">,</span> <span style="color: #00a0e7;">LB</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org22d07ae"></a>ANS<br /><div class="outline-text-5" id="text-12-3-0-2">
<p>
x1 = 2
x2 = 2
x3 = 4
x4 = 3
x5 = 3
x6 = 0
x7 = 8
fval = 22
开销为2200元
</p>
</div></li></ol>
</div>
</div>

<div id="outline-container-org06d4eae" class="outline-2">
<h2 id="org06d4eae"><span class="section-number-2">13</span> <span class="done DONE">DONE</span> 实验三十六</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org2e36c1e" class="outline-3">
<h3 id="org2e36c1e"><span class="section-number-3">13.1</span> 1.</h3>
<div class="outline-text-3" id="text-13-1">
</div><ol class="org-ol"><li><a id="org7210b54"></a>CODE<br /><div class="outline-text-5" id="text-13-1-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #00a6ca;">fun</span> <span style="color: #F92672;">=</span> <span style="color: #E6DB74;">'(x^5+x^3+x^2-1)/(exp(x^2)+sin(-x))'</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #e66965;">X</span> <span style="color: #e96573;">fval</span> <span style="color: #d869b2;">exitflag</span> <span style="color: #d17a3d;">output</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #00a2e1;">fminbnd</span><span style="color: #AE81FF;">(</span><span style="color: #00a6ca;">fun</span><span style="color: #F92672;">,</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">5</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org461399c"></a>ANS<br /><div class="outline-text-5" id="text-13-1-0-2">
<p>
正确，不同的约束条件导致不同的最优化函数，在算法进行求导时，约束条件会改变当某个变量的偏导数为0时变量的值
</p>
</div></li></ol>
</div>
<div id="outline-container-org88318a7" class="outline-3">
<h3 id="org88318a7"><span class="section-number-3">13.2</span> 2.</h3>
<div class="outline-text-3" id="text-13-2">
</div><ol class="org-ol"><li><a id="orgffdca54"></a>CODE<br /><div class="outline-text-5" id="text-13-2-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #00a6ca;">fun</span> <span style="color: #F92672;">=</span> <span style="color: #E6DB74;">'x^2+4*x+4'</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #e66965;">X</span> <span style="color: #e96573;">fval</span> <span style="color: #d869b2;">exitflag</span> <span style="color: #d17a3d;">output</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #00a78d;">fminsearch</span><span style="color: #AE81FF;">(</span><span style="color: #00a6ca;">fun</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org8897305"></a>ANS<br /><div class="outline-text-5" id="text-13-2-0-2">
<p>
-2
</p>
</div></li></ol>
</div>
<div id="outline-container-org57fc4f6" class="outline-3">
<h3 id="org57fc4f6"><span class="section-number-3">13.3</span> 3.</h3>
<div class="outline-text-3" id="text-13-3">
</div><ol class="org-ol"><li><a id="orgc24be5c"></a>CODE<br /><div class="outline-text-5" id="text-13-3-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #00a8a8;">clear</span>
<span style="color: #00a6ca;">fun</span> <span style="color: #F92672;">=</span> <span style="color: #E6DB74;">'(x-2)^4*sin(x)-(x-1)^2*cos(x)'</span><span style="color: #F92672;">;</span>
<span style="color: #AE81FF;">[</span><span style="color: #e66965;">X</span> <span style="color: #e96573;">fval</span> <span style="color: #d869b2;">exitflag</span> <span style="color: #d17a3d;">output</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #00a2e1;">fminbnd</span><span style="color: #AE81FF;">(</span><span style="color: #00a6ca;">fun</span><span style="color: #F92672;">,</span> <span style="color: #F92672;">-</span><span style="color: #AE81FF;">10</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div></li>
<li><a id="org960ddae"></a>ANS<br /><div class="outline-text-5" id="text-13-3-0-2">
<p>
f(min) = f(-2.2939) = -247.6956
</p>
</div></li></ol>
</div>
</div>
